packages/archaea-simulation/archaea_simulation-1.1.21-py3-none-any.whl/archaea_simulation/cfd/case/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

inlet
{
	surfaces
	(
		"inlet.stl"
	);
	
	includedAngle	180;
	
	writeObj	yes;
}

outlet
{
	surfaces
	(
		"outlet.stl"
	);
	
	includedAngle	180;
	
	writeObj	yes;
}

sides
{
	surfaces
	(
		"sides.stl"
	);
	
	includedAngle	180;
	
	writeObj	yes;
}

// zones to replace

// zones
// {
// 	surfaces
// 	(
// 		"zones.stl"
// 	);
// 	includedAngle	180;
// 	writeObj	yes;
// }

// context meshes to replace

// context_meshes
// {
// 	surfaces
// 	(
// 		"context_meshes.stl"
// 	);
// 	includedAngle	180;
// 	writeObj	yes;
// }

#includeEtc "caseDicts/surface/surfaceFeaturesDict.cfg"

// ************************************************************************* //
